app/controllers/api/v1/bulk_items_controller.rb

INSERT INTO `bulk_items` (`quantity`, `created_at`, `updated_at`) VALUES ('4567', '2016-04-20 18:43:56.179716', '2016-04-20 18:43:56.179716')
SELECT  `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`actable_id` = 49 LIMIT 1
INSERT INTO `check_in_transactions` (`entry_date`, `delivery_company`, `created_at`, `updated_at`) VALUES ('2016-04-20', '6', '2016-04-20 18:43:57.313032', '2016-04-20 18:43:57.313032')
INSERT INTO `inventory_items` (`actable_type`, `name`, `project_id`, `status`, `item_type`, `barcode`, `validity_expiration_date`, `value`, `is_high_value`, `user_id`, `item_img_file_name`, `item_img_content_type`, `item_img_file_size`, `item_img_updated_at`, `actable_id`, `created_at`, `updated_at`) VALUES ('BulkItem', 'Elbulktes', 25, 7, 'POP', 'elbulktes-54', '2017-04-20', 234.0, 1, 1, 'Elbulktes.jpg', 'image/jpeg', 145240, '2016-04-20 18:43:55.879234', 49, '2016-04-20 18:43:56.183676', '2016-04-20 18:43:56.183676')
---
  def create
    bulk_item = BulkItem.new(bulk_item_params)
    bulk_item.user = current_user

    # Paperclip adaptor
    item_img = Paperclip.io_adapters.for(params[:item_img])
    item_img.original_filename = params[:filename]
    bulk_item.item_img = item_img

    if bulk_item.save
      @inventory_item = InventoryItem.where('actable_id = ? AND actable_type = ?', bulk_item.id, 'BulkItem').first
      log_checkin_transaction( params[:entry_date], @inventory_item.id, "Entrada granel inicial", params[:estimated_issue_date], params[:additional_comments], params[:delivery_company], params[:delivery_company_contact], params[:bulk_item][:quantity])

      if params[:item_request_id].to_i > 0
        @item_request = InventoryItemRequest.find( params[:item_request_id] )
        send_notifications_approved_entry
        @item_request.destroy
      end

      PmItem.create( :user_id => params[:pm_id], :inventory_item_id => @inventory_item.id ) if params[:pm_id].present?

UPDATE `bulk_items` SET `quantity` = '1096', `updated_at` = '2016-04-19 04:44:08.319183' WHERE `bulk_items`.`id` = 23
UPDATE `inventory_items` SET `state` = 7, `updated_at` = '2016-04-19 04:44:08.321350' WHERE `inventory_items`.`id` = 162
SELECT  `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`actable_id` = 23 LIMIT 1
---
  def re_entry
    bulk_item = BulkItem.find_by_id(params[:id])

    if ! bulk_item.present?
      render json: { errors: "No se encontró el artículo." }, status: 422
      return
    end

    bulk_item.status = InventoryItem::IN_STOCK
    bulk_item.state = params[:state]
    bulk_item.quantity = bulk_item.quantity.to_i + params[:quantity].to_i
    if bulk_item.save
      @inventory_item = InventoryItem.where('actable_id = ? AND actable_type = ?', bulk_item.id, 'BulkItem').first