app/controllers/api/v1/bundle_items_controller.rb

INSERT INTO `bundle_items` (`created_at`, `updated_at`) VALUES ('2016-04-20 18:10:11.381690', '2016-04-20 18:10:11.381690')
SELECT  `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`actable_id` = 45 LIMIT 1
INSERT INTO `check_in_transactions` (`entry_date`, `delivery_company`, `delivery_company_contact`, `created_at`, `updated_at`) VALUES ('2016-04-20', '4', 'Yo', '2016-04-20 18:10:12.716545', '2016-04-20 18:10:12.716545')
INSERT INTO `inventory_items` (`actable_type`, `name`, `project_id`, `status`, `item_type`, `barcode`, `validity_expiration_date`, `value`, `is_high_value`, `user_id`, `item_img_file_name`, `item_img_content_type`, `item_img_file_size`, `item_img_updated_at`, `actable_id`, `created_at`, `updated_at`) VALUES ('BundleItem', 'idontl', 15, 7, 'Pantalla', 'idontl-16', '2017-04-20', 23234.0, 1, 1, 'idontl.jpg', 'image/jpeg', 34743, '2016-04-20 18:20:58.807391', 47, '2016-04-20 18:20:58.976959', '2016-04-20 18:20:58.976959')
INSERT INTO `logs` (`user_id`, `sys_module`, `action`, `actor_id`, `created_at`, `updated_at`) VALUES (1, 'InventoryItem', 'Created bundle item \"TestHV\"', 205, '2016-04-20 18:10:12.728051', '2016-04-20 18:10:12.728051')
---
  def create

    bundle_item = BundleItem.new(bundle_item_params)
    bundle_item.user = current_user

    if ! params[:parts].present?
      bundle_item.errors.add(:parts, 'cannot be empty')
      render json: { errors: bundle_item.errors }, status: 422
      return
    end

    # Paperclip adaptor
    item_img = Paperclip.io_adapters.for(params[:item_img])
    item_img.original_filename = params[:filename]
    bundle_item.item_img = item_img

    if bundle_item.save
      bundle_item.add_new_parts( params[:parts] )
      @inventory_item = InventoryItem.where( 'actable_id = ? AND actable_type = ?', bundle_item.id, 'BundleItem' ).first
      log_checkin_transaction( params[:entry_date], @inventory_item.id, "Entrada paquete", params[:estimated_issue_date], params[:additional_comments], params[:delivery_company], params[:delivery_company_contact], bundle_item.num_parts )

      if params[:item_request_id].to_i > 0
        @item_request = InventoryItemRequest.find( params[:item_request_id] )
        send_notifications_approved_entry
        @item_request.destroy
      end

      PmItem.create( :user_id => params[:pm_id], :inventory_item_id => @inventory_item.id ) if params[:pm_id].present?