app/controllers/api/v1/clients_controller.rb

      def index
        respond_with Client.order(created_at: :desc).all
---
SELECT "clients".* FROM "clients"  ORDER BY "clients"."created_at" DESC