app/controllers/api/v1/deliveries_controller.rb

SELECT COUNT(*) FROM `deliveries` WHERE (status = 1)
---
  def stats
    stats = {}

    shipped = Delivery.shipped.count