app/controllers/api/v1/inventory_transactions_controller.rb

SELECT "inventory_transactions".* FROM "inventory_transactions"  ORDER BY "inventory_transactions"."created_at" DESC
---
      def index
        respond_with InventoryTransaction.search(params, current_user)