app/controllers/api/v1/inventory_items_controller.rb

SELECT "inventory_items".* FROM "inventory_items" WHERE (status IN (1,3))  ORDER BY "inventory_items"."created_at" DESC, "inventory_items"."updated_at" DESC
---
      def index
        respond_with InventoryItem.search(params)

SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", 7]]
---
      def show
        respond_with InventoryItem.find(params[:id]).get_details

SELECT  `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`barcode` = 'mo-flaya' LIMIT 1
---
      def by_barcode
        barcode = params[:barcode].gsub('+', ' ')
        inventory_item = InventoryItem.find_by(barcode: barcode)

SELECT  "inventory_items".* FROM "inventory_items" WHERE (actable_id = 9 AND actable_type = 'BundleItem')  ORDER BY "inventory_items"."id" ASC LIMIT 1
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", 22]]
---
      def multiple_withdrawal
        inventory_items = params[:inventory_items]
        has_errors = false

        folio = InventoryTransaction.next_checkout_folio
        inventory_items.each do |item|
          inventory_item = InventoryItem.find(item[:id])