app/controllers/api/v1/notifications_controller.rb

SELECT COUNT(*) FROM "notifications" INNER JOIN "notifications_users" ON "notifications"."id" = "notifications_users"."notification_id" WHERE "notifications_users"."user_id" = $1 AND "notifications"."status" = $2  [["user_id", 1], ["status", 1]]
---
  def get_num_unread
    if user_signed_in?
      render json: { unread_notifications: current_user.notifications.unread.count }, status: 200

UPDATE `notifications` INNER JOIN `notifications_users` ON `notifications`.`id` = `notifications_users`.`notification_id` SET `notifications`.`status` = '2' WHERE `notifications_users`.`user_id` = 1 AND (status = 1)
---
  def mark_as_read
    notifications = current_user.notifications
    notifications.where( 'status = ?', Notification::UNREAD ).update_all( status: Notification::READ )