app/controllers/api/v1/projects_controller.rb

  def get_project_users
    project = Project.find( params[:id] )
    project_users = project.users

    users = []
    project_users.each do |pu|
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 15 LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `projects_users` ON `users`.`id` = `projects_users`.`user_id` WHERE `projects_users`.`project_id` = 15

  def get_project_client
    project = Project.find( params[:id] )
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 15 LIMIT 1