app/controllers/api/v1/sessions_controller.rb

  def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user.blank?
      render json: { errors: "Invalid email or password" }, status: 422
      return
    end

    if user.valid_password? user_password
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "miguel@pcuervo.com"]]
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_sign_in_at", "2016-05-04 22:29:55.384107"], ["current_sign_in_at", "2016-05-05 23:06:11.336043"], ["sign_in_count", 16], ["updated_at", "2016-05-05 23:06:11.338420"], ["id", 1]]

  def destroy
  	user = User.find_by(auth_token: params[:id])
  	user.generate_authentication_token!
  	user.save
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT 1  [["auth_token", "kR64ZZUJsMkkySeHQkdb"]]
UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", "YDwSJj-DKVhxJ5ZQSaDP"], ["updated_at", "2016-05-05 22:52:19.034117"], ["id", 1]]