app/controllers/api/v1/suppliers_controller.rb

  def index
    respond_with Supplier.order(created_at: :desc).all
---
SELECT `suppliers`.* FROM `suppliers`  ORDER BY `suppliers`.`created_at` DESC

  def create
    supplier = Supplier.new(supplier_params)
    if supplier.save
---
INSERT INTO "suppliers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Litobel"], ["created_at", "2016-05-06 00:14:59.609580"], ["updated_at", "2016-05-06 00:14:59.609580"]]