app/controllers/api/v1/unit_items_controller.rb

  def create

    unit_item = UnitItem.new(unit_item_params)
    unit_item.user = current_user

    if User::CLIENT == current_user.role or User::PROJECT_MANAGER == current_user.role or User::ACCOUNT_EXECUTIVE == current_user.role
      unit_item.status = InventoryItem::PENDING_ENTRY
    end

    # Paperclip adaptor
    item_img = Paperclip.io_adapters.for(params[:item_img])
    item_img.original_filename = params[:filename]
    unit_item.item_img = item_img

    if unit_item.save
      @inventory_item = InventoryItem.where( 'actable_id = ? AND actable_type = ?', unit_item.id, 'UnitItem' ).first
      log_checkin_transaction( params[:entry_date], @inventory_item.id, "Entrada unitaria", params[:estimated_issue_date], params[:additional_comments], params[:delivery_company], params[:delivery_company_contact], 1)
      if params[:item_request_id].to_i > 0
        @item_request = InventoryItemRequest.find( params[:item_request_id] )
        send_notifications_approved_entry
        @item_request.destroy
      end

      PmItem.create( :user_id => params[:pm_id], :inventory_item_id => @inventory_item.id ) if params[:pm_id].present?
---
INSERT INTO `inventory_items` (`actable_type`, `name`, `project_id`, `status`, `item_type`, `barcode`, `validity_expiration_date`, `storage_type`, `is_high_value`, `user_id`, `item_img_file_name`, `item_img_content_type`, `item_img_file_size`, `item_img_updated_at`, `actable_id`, `created_at`, `updated_at`) VALUES ('UnitItem', 'TestHV', 15, 7, 'POP', 'testhv-50', '2017-04-20', 'Permanente', 1, 1, 'TestHV.jpg', 'image/jpeg', 34743, '2016-04-20 00:23:26.812017', 103, '2016-04-20 00:23:27.035287', '2016-04-20 00:23:27.035287')
INSERT INTO `unit_items` (`serial_number`, `created_at`, `updated_at`) VALUES ('3567890', '2016-04-20 00:23:27.032400', '2016-04-20 00:23:27.032400')
SELECT  `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`actable_id` = 103 LIMIT 1
INSERT INTO `check_in_transactions` (`entry_date`, `delivery_company`, `created_at`, `updated_at`) VALUES ('2016-04-20', '6', '2016-04-20 00:23:28.746961', '2016-04-20 00:23:28.746961')