app/controllers/api/v1/users_controller.rb

      def index
        respond_with User.all
---
SELECT `users`.* FROM `users`