app/controllers/api/v1/warehouse_locations_controller.rb

      def show
        respond_with WarehouseLocation.find(params[:id]).get_details
---
SELECT  "warehouse_locations".* FROM "warehouse_locations" WHERE "warehouse_locations"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "item_locations".* FROM "item_locations" WHERE "item_locations"."warehouse_location_id" = $1  [["warehouse_location_id", 4]]