app/controllers/api/v1/warehouse_racks_controller.rb

  def index
    respond_with WarehouseRack.all
---
SELECT `warehouse_racks`.* FROM `warehouse_racks`

  def show_details
    rack = WarehouseRack.find( params[:id] )
---
SELECT  `warehouse_racks`.* FROM `warehouse_racks` WHERE `warehouse_racks`.`id` = 35 LIMIT 1